Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: You must look at each commit being pushed up, see if that string is in the commit message, and, if the string is absent from any of the commits, exit non-zero so the push is rejected.
cs: Každou odesílanou revizi si musíte prohlédnout, zjistit, zda zpráva k revizi obsahuje daný řetězec, a pokud v některé z nich chybí, vrátit nenulovou hodnotu, čímž odesílanou revizi odmítnete.

source: You must run two commands: `git submodule init` to initialize your local configuration file, and `git submodule update` to fetch all the data from that project and check out the appropriate commit listed in your superproject:
cs: Budete muset použít dva příkazy: `git submodule init` k inicializaci lokálního konfiguračního souboru a `git submodule update` k vyzvednutí všech dat z tohoto projektu a checkoutu příslušné revize uvedené ve vašem superprojektu:

source: You need a file in which you can store the SHA-1 value under a simple name so you can use that pointer rather than the raw SHA-1 value.
cs: Hodil by se soubor, do nějž budete pod jednoduchým názvem ukládat hodnotu SHA-1. Tento ukazatel pro vás bude srozumitelnější než nevlídná hodnota SHA-1.

source: You need the signer’s public key in your keyring for this to work properly:
cs: Aby příkaz správně fungoval, musíte mít ve své klíčence veřejný klíč podepisujícího (signer).

source: You need to be careful with this technique because amending changes the SHA-1 of the commit.
cs: Tady byste měli být opatrní, protože oprava revize změní také její hodnotu SHA-1.

source: You need to be sure your working directory is clean when you run this, though.
cs: Nezapomeňte však, že když příkaz spouštíte, je třeba, abyste měli čistý pracovní adresář.

source: You need to edit the script so that it stops at the commit you want to edit.
cs: Skript je třeba upravit tak, aby zastavil na revizi, v níž chcete provést změny.

source: You need to get rid of anything that has a pointer to those old commits before you repack:
cs: Před novým zabalením je třeba odstranit vše, co na tyto staré revize ukazuje:

source: You need to make some changes and commit snapshots of those changes into your repository each time the project reaches a state you want to record.
cs: Řekněme, že potřebujete udělat pár změn a zapsat snímky těchto změn do svého repozitáře pokaždé, když se projekt dostane do stavu, který chcete zaznamenat.

source: You open it again and make that change, and you're ready to commit.
cs: Soubor znovu otevřete, provedete změnu a chcete jej zapsat.

source: You regularly push both of these branches to the public repository.
cs: Obě tyto větve pravidelně odesíláte do veřejného repozitáře.

source: You run `print_export` inside each directory, which takes the manifest and mark of the previous snapshot and returns the manifest and mark of this one; that way, you can link them properly.
cs: V každém adresáři spustíte soubor `print_export`, který vezme manifest a známku předchozího snímku a poskytne manifest a označovač tohoto snímku. Tímto způsobem je lze řádně spojit.

source: You run your test again and find that this commit is broken, so you tell Git that with `git bisect bad`:
cs: Znovu provedete svůj test a zjistíte, že tato revize vykazuje chybu. Systému Git to tedy sdělíte příkazem `git bisect bad`:

source: You saw this in the last section with the `iss53` and `hotfix` branches you created.
cs: Viděli jste to v předchozí části, kdy jste si vytvořili větve `iss53` a `hotfix`.

source: You see how easy it is to take a Git repository, create a bare version, and place it on a server to which you and your collaborators have SSH access.
cs: Vidíte, jak je jednoduché vzít repozitář Git, vytvořit jeho holou verzi a umístit ji na server, k níž máte vy i vaši spolupracovníci SSH přístup.

source: You should also be able to share your branches by pushing them to a shared server, working with others on shared branches and rebasing your branches before they are shared.
cs: Měli byste teď umět odeslat své větve ke sdílení na server, spolupracovat s ostatními na sdílených větvích a přeskládat vaše větve před tím, než je budete sdílet.

source: You should also now have a working version of Git on your system that's set up with your personal identity.
cs: Také byste nyní měli mít nainstalovanou fungující verzi Gitu, nastavenou na vaše osobní údaje.

source: You should feel comfortable creating and switching to new branches, switching between branches and merging local branches together.
cs: Neměli byste teď mít problém s vytvořením nové větve a s přepnutím na ni, s přepínáním mezi větvemi, ani se slučováním lokálních větví.

source: You should feel fairly comfortable contributing to a project in Git as well as maintaining your own project or integrating other users' contributions.
cs: Teď už byste měli mít pocit jistoty jak při přispívání do projektu v Gitu, tak při správě svého vlastního projektu, nebo při integraci příspěvků od ostatních uživatelů.

source: You should have a basic understanding of what Git is and how it's different from the centralized version control system you may have previously been using.
cs: Nyní byste měli mít základní představu o tom, co je to Git a v čem se liší od centralizovaného systému pro správu verzí, který jste možná dosud používali.

source: You should have to do these things only once on any given computer; they'll stick around between upgrades.
cs: Nastavení stačí provést pouze jednou -- zůstanou zachována i po aktualizacích.

source: You should know two important things about `git svn log`.
cs: O příkazu `git svn log` byste měli vědět dvě důležité věci.

source: You should now be able to make Git fit nearly any workflow you can dream up.
cs: Nyní byste měli systém Git bez potíží nastavit téměř na jakýkoli pracovní postup, který si vysníte.

source: You should now have a copy of the Git directory data in your `my_project.git` directory.
cs: V adresáři `my_project.git` byste nyní měli mít kopii dat z adresáře Git.

source: You should only have to use `git apply` for legacy patches and things like that.
cs: Příkaz `git apply` je dobré používat jen pro starší záplaty a podobně.

source: You stage the changes you want by editing a file and running `git add` on it or `git rm` to a tracked file, and the subsequent `git commit --amend` takes your current staging area and makes it the snapshot for the new commit.
cs: Změny, které chcete zapsat, připravíte tím způsobem, že upravíte příslušné soubory a použijete na ně příkaz `git add`, resp. `git rm`. Příkaz `git commit --amend` poté vezme vaši oblast připravených změn v aktuální podobě a vytvoří snímek nové revize.

source: You stage the files, adding snapshots of them to your staging area.
cs: Soubory připravíte k zapsání tak, že vložíte jejich snímky do oblasti připravených změn.

source: You stage these modified files and then commit all your staged changes, and the cycle repeats.
cs: Změněné soubory připravíte k zapsání (stage) a následně všechny připravené změny zapíšete (commit). A celý cyklus se opakuje.

source: You start a new branch based off the current `origin/master` branch, squash the `featureB` changes there, resolve any conflicts, make the implementation change, and then push that up as a new branch:
cs: Začnete vytvořením nové větve z aktuální větve `origin/master`, nacpete (squash) do ní změny z `featureB`, vyřešíte případné konflikty, provedete požadovanou úpravu implementace a vše odešlete jako novou větev:

source: You stick the bare repository copy somewhere everyone has shared access to and set the read/write permissions as you would for any other shared directory.
cs: Kopii holého repozitáře umístíte někam, kam mají všichni sdílený přístup, a nastavíte oprávnění ke čtení/zápisu stejně jako u jakéhokoli jiného sdíleného adresáře.

source: You still get the advantages of things like offline committing and vastly simpler branching and merging, but the workflow can be very similar; the main difference is that merges happen client-side rather than on the server at commit time.
cs: Přesto získáte výhody v takových ohledech, jako je zapisování revizí offline a podstatně snazší větvení a slučování. Pracovní postup však bude velmi podobný. Hlavním rozdílem je to, že slučování probíhá na straně klienta, a ne během zapisování revize na straně serveru.

source: You then fetch from that server, bringing down the new commits.
cs: Vy poté znovu vyzvednete data ze serveru (fetch), čímž získáte nové objekty revizí.

source: You then need to add in this new repository URL as a second remote, in this case named `myfork`:
cs: Poté musíte URL adresu tohoto nového repozitáře přidat jako druhý vzdálený repozitář, v tomto případě pojmenovaný `myfork`:

source: You use this command to artificially add the earlier version of the test.txt file to a new staging area.
cs: Tento příkaz lze použít, jestliže chcete uměle přidat starší verzi souboru test.txt do nové oblasti připravených změn.

source: You want to see what is in your experiment branch that hasn’t yet been merged into your master branch.
cs: Vy chcete vidět, co všechno obsahuje vaše experimentální větev, kterou jste ještě nezačlenili do hlavní větve.

source: You will see these hash values all over the place in Git because it uses them so much.
cs: S těmito otisky se budete setkávat v Gitu všude, protože je používá opravdu často.

source: You work for a while, generally in a topic branch, and merge into your master branch when it's ready to be integrated.
cs: Po určitou dobu pracujete, obvykle na nějaké tématické větvi, a když je připravena k integraci, začleníte ji do své větve `master`.

source: You work on your web site and do some commits.
cs: Pracujete na webových stránkách a zapíšete několik revizí.

source: You'll also take this opportunity to move the work to be based off the project's current `master` branch.
cs: Této příležitosti využijete i k tomu, abyste za základ své práce vzali aktuální stav projektu ve větvi `master`.

source: You'll do the following:
cs: Provedete následující:

source: You'll follow these steps:
cs: Postupujete podle těchto kroků:

source: You'll have to pull down their work first and incorporate it into yours before you'll be allowed to push.
cs: Nejdříve musíte jeho práci stáhnout, zahrnout ji do vaší a teprve potom budete moci vše odeslat.

source: You'll learn how to work in an environment where small groups collaborate on features and then those team-based contributions are integrated by another party.
cs: Naučíte se, jak pracovat v prostředí, v němž na jednotlivých úkolech spolupracují malé skupiny a tyto týmové příspěvky jsou poté integrovány jinou skupinou.

source: You'll notice the phrase ``fast-forward'' in that merge.
cs: Ve výstupu příkazu `merge` si všimněte fráze „fast-forward“.

source: You've decided that you're going to work on issue #53 in whatever issue-tracking system your company uses.
cs: Rozhodli jste se, že budete pracovat na problému #53 (issue), zachyceném v jakémkoliv systému pro sledování chyb, který vaše společnost používá.

source: You've seen one such option already – the `-2` option, which show only the last two commits.
cs: S jednou takovou volbou už jsme se setkali -- šlo o volbu `-2`, která zobrazí pouze dvě poslední revize.

source: Your Git repository now contains five objects: one blob for the contents of each of your three files, one tree that lists the contents of the directory and specifies which file names are stored as which blobs, and one commit with the pointer to that root tree and all the commit metadata.
cs: Váš gitovský repozitář nyní obsahuje pět objektů: jeden blob pro obsah každého z vašich tří souborů, jeden strom, který zaznamenává obsah adresáře a udává, které názvy souborů jsou uloženy jako který blob, a jeden objekt revize s ukazatelem na kořenový objekt stromu a se všemi metadaty revize.

source: Your `inline_data` method looks like this:
cs: Metoda `inline_data` má tuto podobu:

source: Your basic main loop looks like this:
cs: Základní smyčka bude mít tuto podobu:

source: Your branch will contain only work from that commit down:
cs: Vaše větev bude obsahovat pouze práci od této revize níže:

source: Your change is now in the snapshot of the commit pointed to by the `master` branch, and you can deploy the fix.
cs: Vaše změna je nyní obsažena ve snímku revize, na kterou ukazuje větev `master`, a vy můžete zveřejnit opravu.

source: Your commit history looks like this:
cs: Historie revizí bude vypadat nějak takto:

source: Your commit history will look something like this:
cs: Historie revizí bude vypadat nějak takto:

source: Your database contains the two new versions of the file as well as the first content you stored there:
cs: Vaše databáze obsahuje dvě nové verze souboru a počáteční obsah, který jste do ní vložili:

source: Your directory structure looks like this:
cs: Váš adresář má tuto strukturu:

source: Your file contains a section that looks something like this:
cs: Soubor obsahuje část, která vypadá nějak takto:

source: Your history no longer contains a reference to that file.
cs: Vaše historie už neobsahuje referenci na problémový soubor.

source: Your history then looks like this:
cs: Vaše historie pak vypadá následovně:

source: Your import is ready to push up to your new Git server.
cs: Váš import je připraven k odeslání na nový server Git.

source: Your local branches aren't automatically synchronized to the remotes you write to – you have to explicitly push the branches you want to share.
cs: Vaše lokální větve nejsou automaticky synchronizovány se vzdálenými repozitáři, do kterých zapisujete –- ty, které chcete sdílet, musíte explicitně odeslat.

source: Your method looks like this:
cs: Celý postup vypadá takto:

source: Your object is there, so go ahead and get the whole packfile:
cs: Váš objekt se v tomto souboru nachází, a proto neváhejte a stáhněte celý balíčkový soubor:

source: Your staging area now has the new version of test.txt as well as the new file new.txt.
cs: V oblasti připravených změn nyní máte jak novou verzi souboru test.txt, tak nový soubor new.txt.

source: Your strategy will be to go through the snapshots one at a time and create commits with the contents of each directory, linking each commit back to the previous one.
cs: Vaše strategie tedy bude spočívat v tom, že postupně projdete jednotlivé snímky a vytvoříte revize s obsahem každého adresáře, přičemž každá revize bude odkazovat na revizi předchozí.

source: Your working directory is clean:
cs: Váš pracovní adresář se vyčistil:

source: You’ll be able to watch Git rewriting trees and commits and then move the branch pointer at the end.
cs: Uvidíte, jak Git přepisuje stromy a revize a poté přemístí ukazatel větve na konec.

source: You’ll learn a few of the common uses so you can get an idea of some of the things it’s capable of.
cs: Dále poznáte několik běžných situací, v nichž ho lze použít, a získáte tak představu, co všechno příkaz dovede.

source: You’ll often want to do two basic things to your last commit: change the commit message, or change the snapshot you just recorded by adding, changing and removing files.
cs: Na poslední revizi budete často chtít měnit dvě věci: zprávu k revizi nebo čerstvě zapsaný snímek, v němž budete chtít přidat, změnit nebo odstranit soubory.

source: You’re likely to have to either include this code from a shared library like a CPAN install or Ruby gem, or copy the source code into your own project tree.
cs: Pravděpodobně budete muset použít tento kód ze sdílené knihovny, jako CPAN install nebo Ruby gem, nebo zkopírovat zdrojový kód do vlastního stromu projektu.

source: You’ve accomplished the basic tasks of tracking and committing files, and you’ve harnessed the power of the staging area and lightweight topic branching and merging.
cs: Zvládli jste základní úkony sledování a zapisování souborů a pochopili jste přednosti přípravy souborů k zapsání i snadného vytváření a začleňování větví.

source: You’ve partially staged this file.
cs: Soubor je částečně připraven k zapsání.

source: You’ve seen a number of advanced tools that allow you to manipulate your commits and staging area more precisely.
cs: V této kapitole jste poznali několik pokročilých nástrojů umožňujících preciznější manipulaci s revizemi a oblastí připravených změn.

source: [IMPORTANT] ===== It's important to understand that `git checkout -- [file]` is a dangerous command.
cs: [IMPORTANT] ===== Je důležité, abyste porozuměli tomu, že příkaz `git checkout -- [soubor]` je nebezpečný.

source: [NOTE] .Don't type your password every time ==== If you're using an HTTPS URL to push over, the Git server will ask you for your username and password for authentication.
cs: [NOTE] .Nepište pokaždé své heslo ==== Pokud práci odesíláte přes HTTPS URL, vyptává se vás gitový server na jméno a heslo kvůli autentizaci.

source: [NOTE] .Git Diff in an External Tool ==== We will continue to use the `git diff` command in various ways throughout the rest of the book.
cs: [NOTE] .Git diff v externím nástroji ==== Ve zbytku knihy budeme příkaz `git diff` používat různými způsoby.

source: [NOTE] .Switching branches changes files in your working directory ==== It's important to note that when you switch branches in Git, files in your working directory will change.
cs: [NOTE] .Přepnutí větví mění soubory ve vašem pracovním adresáři ==== Považuji za důležité poznamenat, že v Gitu se při přepnutí větví změní soubory ve vašem pracovním adresáři.

source: [NOTE] .Upstream shorthand ==== When you have a tracking branch set up, you can reference it with the `@{upstream}` or `@{u}` shorthand.
cs: [NOTE] .Zkratka pro upstream ==== Pokud máte nastavenu sledující větev, můžete se na ni kdykoliv odkázat zkratkou `@{upstream}` nebo `@{u}`.

source: [NOTE] .``origin'' is not special ==== Just like the branch name ``master'' does not have any special meaning in Git, neither does ``origin''.
cs: [NOTE] .Název „origin“ není nijak speciální ==== Stejně jako jméno větve „master“ nemá pro Git žádný speciální význam, ani název „origin“ není nijak zvláštní.

source: [NOTE] ==== If you need more advanced tools for resolving tricky merge conflicts, we cover more on merging in <<_advanced_merging>>.
cs: [NOTE] ==== Pokud pro řešení zapeklitých konfliktů potřebujete pokročilejší nástroje, podívejte se na podkapitolu <<_advanced_merging>>, která se slučováním zabývá podrobněji.

source: [NOTE] ==== The ``master'' branch in Git is not a special branch.(((master))) It is exactly like any other branch.
cs: [NOTE] ==== Větev „master“ se v Gitu nechápe jako speciální větev.(((master))) Je úplně stejná jako všechny ostatní.

source: [NOTE] ==== This book was written using Git version *2.0.0*.
cs: [NOTE] ==== Tato kniha byla napsána s využitím Gitu verze *2.0.0*.

source: [NOTE] ==== Vim, Emacs and Notepad++ are popular text editors often used by developers on Unix based systems like Linux and OS X or a Windows system.
cs: [NOTE] ==== Vim, Emacs a Notepad++ jsou oblíbené textové editory používané vývojáři v systémech odvozených od Unixu, jako je Linux a OS X, a v systému Window.

source: [NOTE] ==== You may want to use `rebase -i` to squash your work down to a single commit, or rearrange the work in the commits to make the patch easier for the maintainer to review – see <<_rewriting_history>> for more information about interactive rebasing.
cs: [NOTE] ==== Možná budete chtít použít `rebase -i`, abyste svou práci stlačili do jediného zápisu revize, nebo budete chtít práci přeuspořádat do posloupnosti revizí, která správci usnadní zkoumání záplat. Další informace o interaktivním přeskládání najdete v části <<_rewriting_history>>.

source: [NOTE] ===== While `git reset` _can_ be a dangerous command if you call it with `--hard`, in this instance the file in your working directory is not touched.
cs: [NOTE] ===== Příkaz `git reset` sice _může_ být nebezpečný, pokud jej voláte s volbou `--hard`, ale v našem případě zůstane soubor v pracovním adresáři nedotčen.

source: [TIP] ==== GitHub maintains a fairly comprehensive list of good `.gitignore` file examples for dozens of projects and languages at https://github.com/github/gitignore[] if you want a starting point for your project.
cs: [TIP] ==== Pokud pro váš projekt potřebujete něco pro začátek, najdete na stránce https://github.com/github/gitignore[] serveru GitHub poměrně rozsáhlý seznam dobrých příkladů souboru `.gitignore` pro desítky projektů a jazyků.

source: [WARNING] ==== You may find, if you don't setup an editor like this, you will likely get into a really confusing state when they are launched.
cs: [WARNING] ==== Pokud tak neučiníte, pak vás pravděpodobně velmi zmate, až se některý z nich spustí.

source: [[_annotated_tags]] ==== Annotated Tags
cs: [[_annotated_tags]] ==== Anotované značky

source: [[_basic_branching]] ==== Basic Branching
cs: [[_basic_branching]] ==== Základní větvení

source: [[_basic_merge_conflicts]] ==== Basic Merge Conflicts
cs: [[_basic_merge_conflicts]] ==== Základní konflikty při slučování

source: [[_basic_merging]] ==== Basic Merging
cs: [[_basic_merging]] ==== Základní slučování

source: [[_branch_management]] === Branch Management
cs: [[_branch_management]] === Správa větví

source: [[_checking_status]] ==== Checking the Status of Your Files
cs: [[_checking_status]] ==== Kontrola stavu souborů

source: [[_commit_guidelines]] ==== Commit Guidelines
cs: [[_commit_guidelines]] ==== Pravidla pro zápis revizí

source: [[_committing_changes]] ==== Committing Your Changes
cs: [[_committing_changes]] ==== Zapisování změn

source: [[_contributing_project]] === Contributing to a Project
cs: [[_contributing_project]] === Přispívání do projektu

source: [[_create_new_branch]] ==== Creating a New Branch
cs: [[_create_new_branch]] ==== Vytvoření nové větve

source: [[_delete_branches]] ==== Deleting Remote Branches
cs: [[_delete_branches]] ==== Mazání vzdálených větví

source: [[_distributed_git]] == Distributed Git
cs: [[_distributed_git]] == Distribuovaný Git

source: [[_fetching_and_pulling]] ==== Fetching and Pulling from Your Remotes
cs: [[_fetching_and_pulling]] ==== Vyzvedávání a stahování ze vzdálených repozitářů

source: [[_first_time]] === First-Time Git Setup
cs: [[_first_time]] === První nastavení systému Git

source: [[_getting_a_repo]] === Getting a Git Repository
cs: [[_getting_a_repo]] === Získání repozitáře Git

source: [[_getting_started]] == Getting Started
cs: [[_getting_started]] == Úvod

source: [[_git_aliases]] === Git Aliases
cs: [[_git_aliases]] === Aliasy v Gitu

source: [[_git_basics_chapter]] == Git Basics
cs: [[_git_basics_chapter]] == Základy práce se systémem Git

source: [[_git_branches_overview]] === Branches in a Nutshell
cs: [[_git_branches_overview]] === Větve v kostce

source: [[_git_branching]] == Git Branching
cs: [[_git_branching]] == Větve v systému Git

source: [[_git_cloning]] ==== Cloning an Existing Repository
cs: [[_git_cloning]] ==== Klonování existujícího repozitáře

source: [[_git_diff_staged]] ==== Viewing Your Staged and Unstaged Changes
cs: [[_git_diff_staged]] ==== Zobrazení připravených a nepřipravených změn

source: [[_git_help]] === Getting Help
cs: [[_git_help]] === Získání nápovědy

source: [[_git_mv]] ==== Moving Files
cs: [[_git_mv]] ==== Přesouvání souborů

source: [[_git_tagging]] === Tagging
cs: [[_git_tagging]] === Používání značek

source: [[_ignoring]] ==== Ignoring Files
cs: [[_ignoring]] ==== Ignorované soubory

source: [[_inspecting_remote]] ==== Inspecting a Remote
cs: [[_inspecting_remote]] ==== Prohlížení vzdálených repozitářů

source: [[_integration_manager]] ==== Integration-Manager Workflow
cs: [[_integration_manager]] ==== Pracovní postup s integračním manažerem
